<?php

// ===============================
// НАСТРОЙКИ TELEGRAM БОТА
// ===============================

// Токен от @BotFather
define('TOKEN', '8744255864:AAEF78ZYPIYCiipaIrEpKui1dZi6rAMwJAY');


// Адрес Telegram API
define(
    'API_URL',
    'https://api.telegram.org/bot' . TOKEN . '/'
);


// ===============================
// НАСТРОЙКИ БАЗЫ
// ===============================

define(
    'DB_FILE',
    __DIR__ . '/clan_bot.db'
);


// ===============================
// ЛОГИ
// ===============================

define(
    'LOG_FILE',
    __DIR__ . '/bot.log'
);


// ===============================
// РОЛИ КЛАНА
// ===============================
//
// 1 - самая низкая роль
// 5 - самая высокая
//

$RANKS = [

    1 => [
        'name' => 'олды',
        'emoji' => '🛡',
        'kv' => false,
        'aliases'=>[
            'олд',
            'олды',
            '1'
        ],
    ],

    2 => [
        'name' => 'игроки',
        'emoji' => '🎮',
        'kv' => true,
        'aliases'=>[
            'игроки',
            'игрок',
            '2'
        ],
    ],

    3 => [
        'name' => 'старики',
        'emoji' => '⭐',
        'kv' => true,
        'aliases'=>[
            'старики',
            'старик',
            '3'
        ],
    ],

    4 => [
        'name' => 'соруки',
        'emoji' => '⚔',
        'kv' => true,
        'aliases'=>[
            'соруки',
            'сорук',
            '4'
        ],
    ],

    5 => [
        'name' => 'руководители',
        'emoji' => '👑',
        'kv' => false,
        'aliases'=>[
            'руководители',
            'руководитель',
            '5'
        ],
    ],
    
    6 => [
    'name'=> 'руководители',
    'emoji'=> '👑',
    'kv'=> false,
        'aliases'=>[
            'руководители',
            'руководитель',
            '6'
        ],
    ],

];


// ===============================
// ПОРЯДОК ВЫВОДА СПИСКА
// ===============================

$LIST_ORDER = [

    5,
    4,
    3,
    2,
    1

];


// ===============================
// КОМАНДЫ РУКОВОДСТВА
// ===============================

$ADMIN_COMMANDS = [

    'звание',
    'повысить',
    'понизить',
    'удалить',
    'атакуем',
    'объявление'

];


// ===============================
// НАСТРОЙКИ КВ
// ===============================

define(
    'KV_YES',
    'да'
);

define(
    'KV_NO',
    'нет'
);

?>